       IDENTIFICATION DIVISION.
       AUTHOR. ARIEL. GIMENEZ.
       SECURITY. Desarrolle un diagrama de flujo indicando los pasos para: Ingresar la nota del exámen de Algoritmos y si es mayor o igual a siete imprimir que aprobó,  sino que no aprobó
       PROGRAM-ID. CLASE15-EJERCICIO-CLASE-7-2.

       DATA DIVISION.
           WORKING-STORAGE SECTION.
               01 NOTAALUMNO PIC 99 VALUE ZERO.
               
       PROCEDURE DIVISION.
           

       STOP RUN.
      